Using the `movies_db` database, write the correct SQL queries for each of these tasks:

## 1.  The title of every movie.

In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [4]:
# Connect to PostgreSQL database
engine = create_engine('postgresql://postgres:Decoy%401973@localhost:5432/movies_db')

In [5]:
# Query the database
query = "SELECT title FROM movies;"
df = pd.read_sql(query, engine)

In [6]:
# Display results
print(df.head())

                          title
0  Star Wars: The Force Awakens
1         Marvel's The Avengers
2      Star Wars: The Last Jedi
3                 Black Panther
4  Rogue One: A Star Wars Story

## 2.  All information on the G-rated movies.

In [7]:
query = "SELECT * FROM movies WHERE rating = 'G';"
df = pd.read_sql(query, engine)

In [8]:
# Display results
print(df.head())

   id                title  release_year  runtime rating  studio_id
0  20        The Lion King          1994       89      G          1
1  21          Toy Story 3          2010      103      G          1
2  33         Finding Nemo          2003      104      G          1
3  86       Monsters, Inc.          2001       90      G          1
4  95  Monsters University          2013      107      G          1

## 3. The title and release year of every movie, ordered with the oldest movie first.

In [9]:
query = "SELECT title, release_year FROM movies ORDER BY release_year ASC;"
df = pd.read_sql(query, engine)

In [10]:
# Display results
print(df.head())

                          title  release_year
0                     Star Wars          1977
1       The Empire Strikes Back          1980
2  E. T.: The Extra-Terrestrial          1982
3            Return of the Jedi          1983
4                    Home Alone          1990

## 4. All information on the 5 longest movies.

In [11]:
query = "SELECT title, runtime FROM movies ORDER BY runtime DESC LIMIT 5;"
df = pd.read_sql(query, engine)

In [12]:
# Display results
print(df)

                                           title  runtime
0      The Lord of the Rings: Return of the King      200
1                                        Titanic      194
2          The Lord of the Rings: The Two Towers      179
3  The Lord of the Rings: Fellowship of the Ring      178
4       Pirates of the Caribbean: At World's End      168

## 5. A query that returns the columns of `rating` and `total`, tabulating the total number of G, PG, PG-13, and R-rated movies.

In [13]:
query  = "SELECT rating, COUNT(*) AS total FROM movies GROUP BY rating ORDER BY total DESC;"
df = pd.read_sql(query, engine)

In [14]:
# Display results
print(df.head())

  rating  total
0  PG-13     64
1     PG     25
2      R      6
3      G      6

## 6. A table with columns of `release_year` and `average_runtime`, tabulating the average runtime by year for every movie in the database. The data should be in reverse chronological order (i.e. the most recent year should be first).

In [15]:
query = "SELECT release_year, ROUND(AVG(runtime), 2) AS average_runtime FROM movies GROUP BY release_year ORDER BY release_year DESC;"
df = pd.read_sql(query, engine)

In [16]:
# Display results
print(df.head())

   release_year  average_runtime
0          2018           129.50
1          2017           130.75
2          2016           118.30
3          2015           122.86
4          2014           125.33

## 7. The movie title and studio name for every movie in the database.

In [17]:
query = "SELECT movies.title, studios.name FROM movies JOIN studios ON movies.studio_id = studios.id;"
df = pd.read_sql(query, engine)

In [18]:
# Display results
print(df.head())

                          title                                 name
0  Star Wars: The Force Awakens  Walt Disney Studios Motion Pictures
1         Marvel's The Avengers  Walt Disney Studios Motion Pictures
2      Star Wars: The Last Jedi  Walt Disney Studios Motion Pictures
3                 Black Panther  Walt Disney Studios Motion Pictures
4  Rogue One: A Star Wars Story  Walt Disney Studios Motion Pictures

## 8. The star first name, star last name, and movie title for every matching movie and star pair in the database.

In [19]:
query = "SELECT stars.first_name, stars.last_name, movies.title FROM roles JOIN stars ON roles.star_id = stars.id JOIN movies ON roles.movie_id = movies.id;"
df = pd.read_sql(query, engine)

In [20]:
# Display results
print(df.head())

  first_name  last_name                                      title
0    Frances  McDormand             Transformers: Dark of the Moon
1       Emma     Watson                       Beauty and the Beast
2       Emma     Watson      Harry Potter and the Sorcerer's Stone
3       Emma     Watson     Harry Potter and the Half-Blood Prince
4       Emma     Watson  Harry Potter and the Order of the Phoenix

## 9. The first and last names of every star who has been in a G-rated movie. The first and last name should appear only once for each star, even if they are in several G-rated movies. *IMPORTANT NOTE*: it's possible that there can be two *different* actors with the same name, so make sure your solution accounts for that.

In [21]:
query = "SELECT DISTINCT stars.id, stars.first_name, stars.last_name FROM stars JOIN roles ON stars.id = roles.star_id JOIN movies ON roles.movie_id = movies.id WHERE movies.rating = 'G';"
df = pd.read_sql(query, engine)

In [22]:
# Display results
print(df.head())

   id first_name  last_name
0  18        Tom      Hanks
1  39    Michael     Keaton
2  49      Ellen  DeGeneres

## 10. The first and last names of every star along with the number of movies they have been in, in descending order by the number of movies. (Similar to #9, make sure that two different actors with the same name are considered separately).

In [23]:
query = "SELECT stars.id, stars.first_name, stars.last_name, COUNT(roles.movie_id) AS movie_count FROM stars JOIN roles ON stars.id = roles.star_id GROUP BY stars.id, stars.first_name, stars.last_name ORDER BY movie_count DESC;"
df = pd.read_sql(query, engine)

In [24]:
# Display results
print(df.head())

   id first_name   last_name  movie_count
0  17     Samuel     Jackson            9
1   3       Emma      Watson            8
2   4     Daniel   Radcliffe            7
3  50     Robert  Downey Jr.            7
4  14   Scarlett   Johansson            6

# Everything that follows is Bonus

## 11. The title of every movie along with the number of stars in that movie, in descending order by the number of stars.

In [26]:
query = "SELECT movies.title, COUNT(roles.star_id) AS star_count FROM movies JOIN roles ON movies.id = roles.movie_id GROUP BY movies.id, movies.title ORDER BY star_count DESC;"
df = pd.read_sql(query, engine)

In [27]:
# Display results
print(df.head())

                                       title  star_count
0                    Avengers: Age of Ultron           4
1                              Black Panther           3
2                      The Dark Knight Rises           3
3                                 Iron Man 2           3
4  Star Wars: Episode I - The Phantom Menace           3

## 12. The first name, last name, and average runtime of the five stars whose movies have the longest average.

In [28]:
query = "SELECT stars.first_name, stars.last_name, ROUND(AVG(movies.runtime), 2) AS average_runtime FROM stars JOIN roles ON stars.id = roles.star_id JOIN movies ON roles.movie_id = movies.id GROUP BY stars.id, stars.first_name, stars.last_name ORDER BY average_runtime DESC LIMIT 5;"
df = pd.read_sql(query, engine)

In [29]:
# Display results
print(df.head())

  first_name      last_name  average_runtime
0       Kate        Winslet           194.00
1      Kathy          Bates           194.00
2        Ian       McKellen           170.40
3     Morgan        Freeman           157.50
4     Joseph  Gordon-Levitt           154.67

## 13. The first name, last name, and average runtime of the five stars whose movies have the longest average, among stars who have more than one movie in the database.

In [30]:
query = "SELECT stars.first_name, stars.last_name, ROUND(AVG(movies.runtime), 2) AS average_runtime FROM stars JOIN roles ON stars.id = roles.star_id JOIN movies ON roles.movie_id = movies.id GROUP BY stars.id, stars.first_name, stars.last_name HAVING COUNT(movies.id) > 1 ORDER BY average_runtime DESC LIMIT 5;"
df = pd.read_sql(query, engine)

In [31]:
# Display results
print(df.head())

  first_name      last_name  average_runtime
0        Ian       McKellen           170.40
1     Morgan        Freeman           157.50
2     Joseph  Gordon-Levitt           154.67
3     Daniel      Radcliffe           148.43
4      Keira      Knightley           146.75

## 14. The titles of all movies that don't feature any stars in our database.

In [32]:
query = "SELECT movies.title FROM movies LEFT JOIN roles ON movies.id = roles.movie_id WHERE roles.star_id IS NULL;"
df = pd.read_sql(query, engine)

In [33]:
# Display results
print(df.head())

                                              title
0                                     The Lion King
1  The Chronicles of Narnia: Lion, Witch & Wardrobe
2                                           Gravity
3                      E. T.: The Extra-Terrestrial
4                                      Man of Steel

## 15. The first and last names of all stars that don't appear in any movies in our database.

In [34]:
query = "SELECT stars.first_name, stars.last_name FROM stars LEFT JOIN roles ON stars.id = roles.star_id WHERE roles.movie_id IS NULL;"
df = pd.read_sql(query, engine)

In [35]:
# Display results
print(df.head())

  first_name last_name
0     Wesley    Snipes
1       Sean   Connery
2      Jamie      Foxx
3        Jim    Carrey
4   Angelina     Jolie

## 16. The first names, last names, and titles corresponding to every role in the database, along with every movie title that doesn't have a star, and the first and last names of every star not in a movie.